[
  {
    "id": "0359bc68-5631-433e-9811-5ca38d23acb9",
    "source": "https://www.theguardian.com/lifeandstyle/2019/nov/25/vegan-runners-can-a-plant-based-diet-provide-what-you-need-to-compete-and-win",
    "title": "Vegan runners: can a plant-based diet provide what you need to compete – and win?",
    "promoImage": "https://i.guim.co.uk/img/media/94ae0e43df717290e6a6b9dc92abccc2a82b32a4/0_223_3000_1800/master/3000.jpg?width=1225&quality=85&auto=format&fit=max&s=61aee3dc8d236c0ce57c234a48e3ea89",
    "preamble": "Fiona Oakes was a lone crusader when she set up a running club for vegans 15 years ago. Now, she holds four world records",
    "body": [
      {
        "bodyType": "text",
        "data": "“In 2004, I was the only vegan in the village,” says Fiona Oakes, a multi-world-record-breaking marathon runner. “But now you see vegan runners everywhere.”\n\nAn animal lover who set up her own animal sanctuary, Oakes started a running club called Vegan Runners in 2004. The idea came about after she saw the long-distance runner Paula Radcliffe on TV and spotted an opportunity. Oakes was a good runner and thought that, if she got faster, she could end up alongside Radcliffe at the start line of the London marathon, on national television, with the words “Vegan Runners” emblazoned across her vest.\n\n“It was a way of showcasing the cause,” she says. “I’d been vegan since I was six years old. I’d lost my kneecap from an illness when I was 17 and been told I would never run again. If I could do this as a vegan, it showed that anything was possible.”\nBack then she was a lone crusader, trying to introduce people to the word “vegan” in a positive way. “Rather than cause disruption and be in people’s faces, by running, I was leading by example and generating interest in a positive way,” she says.\n\nShe went on to twice finish in the top 20 in major marathons, with a personal best of two hours 38 minutes, and also won the north pole marathon. Oakes’ powerful example has seen the Vegan Runners steadily increase their numbers over the years. But with the interest in veganism growing, partly in response to the global climate crisis, the club’s numbers have swelled exponentially in the past three years; there are almost 4,000 today, with more than 40 local groups across the country, their distinctive tops unmissable at races."
      },
      {
        "bodyType": "image",
        "data": "https://i.guim.co.uk/img/media/bf5b955fd73a63d09f49938ec08043407d8120b1/0_0_2120_3184/master/2120.jpg?width=620&quality=85&auto=format&fit=max&s=642577ffdd57230b9f6f3d6f60f6e25e"
      },
      {
        "bodyType": "text",
        "data": "Club activities vary at each branch, but typically involve weekly training runs and group attendance at events such as local parkruns – usually with a visit to a vegan cafe afterwards.\n\nUnderstandably, members are expected to be vegan not just in their diet but in their choice of clothing. Oakes says that the expectation is for members to be living a fully plant-based lifestyle.\n\nMike Exton from Sheffield joined Vegan Runners in June. Although he is vegan, he primarily joined because the training runs were local. “I do find it a little tricky being pigeonholed as a vegan runner,” he says. But he feels more comfortable wearing the Vegan Runners vest now than he might have done five years ago, as veganism has become “less weird”.\n\n“In many ways it’s just another running club,” he says, “though we do tend to chat about food, recommending things to try and getting advice on nutrition.”\n\nLisa Gawthorne joined Vegan Runners in 2018. She says it is great to be surrounded by like-minded people and that the club forms “a really kind and compassionate running community”.\n\n“I think it’s important to bounce off people who are going through similar things to you and to share experiences,” she says. “This may include tips on nutrition or the best vegan running shoes. It all helps.” Most running shoes that don’t use leather or suede are vegan, but sometimes the glues used in shoes can be made from animal products. The Vegan Runners’ website has a helpful guide to which brands are fully vegan.\n\nGawthorne has been vegan for 16 years and is an international road runner and duathlon athlete. She believes being vegan has helped her to perform at such a high level. “It improves recovery time, is better for the digestive system and promotes better sleep,” she says. “I have never had as much energy as I have since moving from a vegetarian to a vegan diet.”\n\nNot everyone shares this view. Tim Noakes, a South African sports scientist famous for his promotion of a high-fat, meat-rich diet, says a vegan diet is “incomplete in so many ways”. “In time, a truly vegan athlete will run into trouble unless they are sourcing additional animal-based nutrients – such as vitamin B12, iron, choline and probably high-quality proteins – from somewhere else,” he says.\n\nDietitian Renee McGregor, who works with international ultra-runners, says that while it is possible to be vegan and a good runner, it needs a lot of careful planning. “In my clinic, many of the athletes that come in with relative energy deficiency have become vegan,” she says, adding that the high intake of fibre more common in a vegan diet can impact the absorption of nutrients such as iron and calcium, as well as displace energy intake.\n\nThere are not enough long-term studies to show how vegan diets impact athletic performance, which leaves us with a battleground of anecdotal evidence. Some of the world’s leading long-distance runners swear by the meat-heavy diet promoted by Noakes, while others are vegan, spearheaded by the legendary ultra-runner Scott Jurek, whose seven consecutive victories in the most competitive ultra-marathon in the US, the Western States 100-mile endurance run, make the case that a vegan diet doesn’t have to be incompatible with running.\n\nFor Oakes, proving this to the world is what gets her out of bed on cold mornings. “It gives me a reason to get up and train,” she says. “To show what is possible, and to promote what I believe in.”"
      }
    ]
  },
  {
    "id": "182c06de-a515-46dc-b271-711f24d79747",
    "source": "https://www.theguardian.com/lifeandstyle/2019/nov/20/no-downside-day-trip-just-dont-call-it-a-daycation",
    "title": "There is no downside to a day trip – just don’t call it a 'daycation'",
    "promoImage": "https://i.guim.co.uk/img/media/cc92a1d3cb543b6e8d05277fde8a8c498b0e8771/0_192_5760_3456/master/5760.jpg?width=620&quality=85&auto=format&fit=max&s=fe46ecfbc455acdbc3af15be976e6c2e",
    "preamble": "A miniature jaunt to British pebbles or historical cities is a way of experiencing the world in bitesize",
    "body": [
      {
        "bodyType": "text",
        "data": "OK, let’s get the bad out of the way: the portmanteau “daycation”, a monstrous offshoot of the almost-equally offensive “staycation”. Given that I believe day trips are 12-hour delights, they do not deserve to be labelled in such a painful way.\\n\\nWherever one lives, and whatever one feels about that place, there is never a downside to going on a miniature jaunt. It’s a means of experiencing the world in bitesize; broadening one’s horizons, but not too much. If the trip goes badly, it doesn’t matter, because: a) it is short and b) it has the effect of casting a new light on one’s regular environment.\\n\\nOne thing wealthy people do not understand about those with lesser financial means (and judge them for) is how they manage to – shock horror – own mobile phones, or laptops, or things that cost a few bob. What they are missing is that people who can’t afford neverending luxuries will focus on treats to make the mundane bearable. Big treats saved up for, perhaps, or indulgences little and often.\\n\\nMost of us cannot afford always to take five-star holidays to white sands and waters as clear as vodka, but day trips to British pebbles or birch trees or historical cities are in reach. (At least, for non-drivers, when private rail companies aren’t charging hundreds for train tickets.)\\n\\nThere are multiple thrills. The planning itself is exciting. Firing up Google Maps; browsing whatever the place has to offer and making a suggested itinerary, bookmarks galore. I want to visit art galleries, swim in the sea, eat Victoria sponge and sip at hand-warming coffee, pose outside National Trust homes as if I live there. I’ll admit I’ve never pulled off being “good” at museums. I guess I like my history to be under my feet, on location, or on the pages of a book.\\n\\nThough compiling the list of things to do (TripAdvisor reviews read; Instagram pictures scouted) is part of the fun, even more so is following one’s nose once there. Sometimes, a trip will be so successful it might spill overnight. This is even more likely when with close pals, who make the best companions for these explorations. (This level of spontaneity depends on the company. New lover? Tired children?)\\n\\nDomestic holidays pretty much fell out of fashion with the advent of budget flights; especially trips to seaside towns that Victorians enjoyed so much. But with a crappy economy, flight-shaming in the light of a climate crisis and our time-poor lifestyles, I’d argue they are on the rise again. So, see you at a bus station in the hinterland, checking timetables."
      }
    ]
  },
  {
    "id": "37584e63-ab9a-4833-8afa-41b06077bdc7",
    "source": "https://www.theguardian.com/lifeandstyle/2019/nov/29/dopamine-fasting-tech-fad-might-work",
    "title": "Dopamine fasting is a tech fad that sounds silly – but might just work",
    "promoImage": "https://i.guim.co.uk/img/media/f334f61406c66a4495f79e91d29c33eb3f3a297d/0_3_1453_872/master/1453.jpg?width=620&quality=85&auto=format&fit=max&s=781a74abe6980d890780be36c61d4407",
    "preamble": "Depriving your brain of stimulation can rewire your frazzled neural circuits – but the problem runs deeper than that",
    "body": [
      {
        "bodyType": "text",
        "data": "The problem with ridiculous Silicon Valley lifestyle trends used to be the risk that people might take them seriously: that it might seem sensible to eat an all-carrot diet, while bathing in liquid nitrogen and administering electric shocks to your brain, just because some tech billionaire was doing so. Now that we’re adjusting our views of tech titans, the risk is the opposite: that if they actually came up with something good, we’d be too busy jeering to realise. So it goes, I think, with “dopamine fasting”, which got its moment in the mockery spotlight a few weeks back. The idea is to deprive yourself of dopamine hits, to break your addiction to our hyperstimulating world, thereby finding pleasure once again in life’s more meaningful but less buzz-inducing delights, such as natural beauty, good literature, or time with old friends.\n\nTo be fair, it’s still nonsense in many ways. Stimulation is more complex than dopamine hits; it’s misleading to talk of addiction; and there’s no evidence that a fast will “reset” your levels. (“Reset”, here, seems like a classic case of importing a computer metaphor into human biology.) But I like the concept anyway, because it shifts the focus from individual sources of stimulation to the brain being stimulated. If your goal is to end your dependence on excitement, and the treadmill effect whereby you require ever more of it, then it’s definitely helpful to spend a day without, say, social media. But it’ll be of limited use if you fill that time with different forms of stimulation – watching thrilling movies, taking drugs, eating junk food, shopping. The most radical proponents of dopamine fasting swear off any conversation at all.\n\nI was going to try it – until it dawned on me that I already have, several times, under the (slightly) less fashionable label of “going on a meditation retreat”. The rules are similar – no screens, reading, talking, sex, alcohol, meat-eating – and while meditation isn’t “doing nothing”, it certainly involves surrendering your dependence on external excitement. And the results are everything a dopamine-faster might want: renewed sensitivity to nature, and to the flavours of food; less impatience with others; better sleep; and a greater ability to read books without the urge to reach for your phone.\n\nIt takes a few days to get there, though. Until then, it can be fairly awful. The inevitable flipside of living in a world of unprecedented stimulation is that when it’s absent, experience can feel maddeningly boring. The problem with “persuasive design”, the armory of psychological techniques used by tech platforms to ensure your attention never wavers, is that the rest of reality wasn’t designed that way. And the problem with depriving yourself of thrilling distractions from the present moment is that you’re left, in the words of the psychotherapist Bruce Tift, feeling “claustrophobic, imprisoned, powerless, and constrained by reality”.\n\nIt’s worth pushing through the pain, though – and if calling it “dopamine fasting” helps, who really cares? My issue with tech bros isn’t the language they use. It’s that after a Sunday spent dopamine fasting, they go straight back to their work of keeping the rest of us hooked."
      }
    ]
  },
  {
    "id": "fa265925-54c2-48ad-8729-fef03b0c597b",
    "source": "https://www.theguardian.com/lifeandstyle/2019/nov/24/how-to-blow-your-nose-properly",
    "title": "How to blow your nose properly",
    "promoImage": "https://i.guim.co.uk/img/media/3cfc69ce939f631d88048c41740cf8fa6032efc8/0_248_7360_4417/master/7360.jpg?width=620&quality=85&auto=format&fit=max&s=12ab3f1dff38ffbe583ce155804c903a",
    "preamble": "Clearing blocked passages is more important for comfort than for health reasons – but if you are really struggling to stay clear, there are ways to do it",
    "body": [
      {
        "bodyType": "text",
        "data": "If you blow your nose too hard, you can potentially send enough pressure up the tubes that connect the ears to the back of the nose and rupture your eardrum, but you’d have to blow pretty hard to do that. The main thing with blowing your nose too vigorously is that it can cause it to bleed – too much pressure can cause blood vessels to burst – but it’s never usually dramatic. You may just notice some bloodstains on your tissue.\n\nYou can blow both nostrils at the same time, but you may have a deviation in the midline partition – the septum – which may make it difficult. You may find it easier to do one, then the other.\n\nBlowing your nose is mostly for comfort – most people do it because they have a feeling of excess mucus in their nose. We all produce a pint and a half of mucus every day, which we swallow without noticing. Most of the time, you blow your nose because you have an excess of mucus production – you have a cold, nasal allergy, hay fever or other condition. If you work in a polluted environment, blowing your nose is a way of clearing out mucus that has collected debris and pollutants from the atmosphere.\n\nNasal douching with a saline solution is a technique doctors recommend for patients with various nasal disorders, such as allergies and people with rhinosinusitis (nasal inflammation), and an additional way to clear excess mucus. You can get a kit from your pharmacist or supermarket.\n\nCarl Philpott, a consultant ear, nose and throat surgeon and honorary secretary of ENT UK, was talking to Emine Saner"
      }
    ]
  },
  {
    "id": "5be95dcd-a837-459f-aae9-24b337c5a337",
    "source": "https://www.theguardian.com/lifeandstyle/2019/dec/02/one-step-at-a-time-exercise-mental-health",
    "title": "One step at a time: how to improve mental health through fitness",
    "promoImage": "https://i.guim.co.uk/img/media/98eab90c4997000ba0f1dc27d92ae5189b274b8a/0_200_7360_4417/master/7360.jpg?width=620&quality=85&auto=format&fit=max&s=c51b6f0b1938e4f475852fc5aebe66dd",
    "preamble": "From regular walks to workouts or team sports, there are all kinds of activities that can help anxiety and depression. Here’s how to get started",
    "body": [
      {
        "bodyType": "text",
        "data": "When you are struggling with your mental health, getting active may be one of the last things you feel like doing. But if you can muster the energy, evidence shows that exercise has a powerfully beneficial effect. One 2019 study, published in JAMA Psychiatry, found that physical activity is an effective prevention strategy for depression. Another 2015 paper found that exercise can be as helpful in treating mild to moderate depression as antidepressants and psychotherapy.\n\n“We have known for a long time that exercise promotes physiological and neurochemical responses that make you feel good,” says Prof Nanette Mutrie of the University of Edinburgh’s Institute for Sport, Physical Education and Health Sciences. When we exercise, the brain releases endorphins, as well as dopamine and serotonin. “Very often, these same chemicals form part of antidepressant drugs,” she says.\n\nThere is also a psychological component to exercise that makes us feel good, says Mutrie. “When you’re exercising, you are improving your self-esteem, mastering a new task and meeting new people. All of this forms part of the mix. There’s this synergy of positive things that is happening.”\n\nIf you are struggling with your mental health and are anxious about exercise, the best advice is to start small. “Your goals should be really achievable,” advises Sarah Overall, a London-based personal trainer who is qualified to take referrals from the NHS. “Take it slowly and be proud of every step you take.” She also says you will have setbacks along the way and shouldn’t feel discouraged. “Fitness isn’t linear,” she says. “You can go for a run one day and feel OK, and the next time feel rubbish.” She suggests exercising with a trusted friend, so that you have someone to check in with if you are feeling anxious.\n\nMutrie suggests a simple walking programme. “Aim to increase the amount you are walking over the course of a month. Start with walking for 10 minutes a day and gradually up it.” Most smartphones now have pedometers, so you can track your steps: 7,000 steps a day is a good target to set yourself, with the aim of eventually increasing it to the government recommendation of 10,000 steps daily."
      },
      {
        "bodyType": "image",
        "data": "https://i.guim.co.uk/img/media/2bf087e11c34332a473695cdbf26a0d7334e7b93/0_488_4869_2921/master/4869.jpg?width=620&quality=85&auto=format&fit=max&s=e4f8142cc638f1b8625e593a14b6b16a"
      },
      {
        "bodyType": "text",
        "data": "Jermaine Johnson, another personal trainer who often trains clients with depression and anxiety, suggests avoiding cardio. “That can raise the heart rate and fuel your anxiety,” he says. Instead, he suggests that you try strength training. “I’ve trained people with depression who’ve said weightlifting made a big difference.” Because you can measure your progress with weight training – heavier weights or more repetitions – you will be able to see how much you are improving, which could lift your mood.\n\nYou don’t have to exercise all the time. “If you want to optimise your exercise regime for your mental health, according to our research, exercising for 45 minutes at a time, three to five times a week, has the most beneficial mental health effects,” says Dr Adam Chekroud of Yale School of Medicine. He is the co-author of one of the biggest studies into exercise and mental health, which looked at 1.2 million adults in the US. He says that cycling and team sports will give you the biggest boost, but even walking or doing household chores are better than nothing.\n\nIt’s a good idea to pick times when gyms are less busy, so you won’t feel like you are being watched. “Speak to the gym manager and ask them about their quiet times and quiet areas,” Overall says. If you’re able to slip away from work, gyms are generally quiet in the mid-afternoon. Plus, you won’t have to drag yourself out of bed at the crack of dawn. “If it’s dark or rainy, it can be hard to get up early, especially if you’re struggling with depression,” she says.\n\nJust being in nature has also been shown to have beneficial mental health effects. “You need sunlight for vitamin D, and vitamin D lifts your mood,” says Overall. Look for a Green Gym near you: these free, conservation-based workouts are a great way to meet people in your local area, if you’re feeling lonely; sign up and you could be planting trees or sowing seeds alongside other participants. Beyond that, the mental health charity Mind has a directory of fitness classes and other outdoor activities on its website (mind.org.uk), many of which are free.\n\nIf you feel up to being around other people, group exercise can help. “When it comes to depression or stress, these conditions have a biological underpinning, but they also have social components,” Chekroud says. The sense of community you feel as part of a sports team can have a brightening effect on your mood. “It takes the attention away from the individual person,” says Johnson. And if you end up feeling overwhelmed or anxious in the class, it is fine to leave early. “You always have the option to leave. I’ve had people who’ve walked out of my classes,” he says. “That’s fine.” If you’re feeling very anxious before a class, give the trainer a heads-up that you’re not feeling great, and might slip out early – and pick a spot near the door for minimum fuss."
      },
      {
        "bodyType": "image",
        "data": "https://i.guim.co.uk/img/media/7e1ac08c838e5c86e01284e94eee7901c2171919/0_214_5037_3022/master/5037.jpg?width=620&quality=85&auto=format&fit=max&s=fe99d4b2510c82a4e9fa9b151f01dd35"
      },
      {
        "bodyType": "text",
        "data": "Johnson recommends starting with a yoga or a barre class, rather than a circuits class, as often these involve partner-work, which can be difficult for those with social anxiety. Whatever you are doing, pick a beginner’s class: now is not the time to throw yourself into Bikram yoga. “If a class is too intense, you’re going to feel like you’re doing badly, and you may end up feeling worse than you did when you arrived,” Johnson says. “That is definitely not the goal.”\n\nAnyone struggling with body dysmorphia “should avoid gyms, as they are full of mirrors”, says Overall. “Instead, take things outside if you can.” Try jogging or doing a high-intensity interval training workout in the park. If you are in recovery from an eating disorder, Overall recommends creating an exercise plan under the supervision of a mental health professional, to avoid overdoing it. “Otherwise, it’s like an alcoholic going back in a pub. It’s got to be carefully managed.”\n\nIf you don’t feel as if you can leave your house, there are plenty of fitness videos online that you can do at home. Try Fitness Blender, or download the Nike app. If you can afford a personal trainer, look for one who has an exercise referral qualification, meaning they are accredited to work with the NHS. Explain your mental health challenges to them and have them tailor an appropriate programme; speak to your doctor to ensure your workout is medically safe.\n\nWhen you are exercising, it is absolutely fine to take a break, or stop entirely, if you are feeling overwhelmed. “Don’t feel like you have failed because you had to stop,” says Overall. When you are struggling with your mental health, it is easy to get trapped in a spiral of negative thoughts and think that everyone in your gym is watching you. But they are almost certainly not, says Johnson. “Ninety per cent of the time, people aren’t thinking about you – they’re focusing on their own workout.”\n\nFinally, the act of putting on a pair of trainers can, on its own, be a form of self-care. “Even if you leave after a few minutes, you’ve already achieved something just by going to the gym,” says Johnson. Focus on the fact that you went to the gym in the first place, not that you left. And take everything one step at a time. You’re in control."
      }
    ]
  },
  {
    "id": "200b8d52-f242-410e-be55-d2a8487810dd",
    "source": "https://joebirch.co/2019/11/26/exploring-jetpack-compose-container/",
    "title": "Exploring Jetpack Compose: Container",
    "promoImage": "https://joebirch.files.wordpress.com/2019/11/group.png?w=820",
    "preamble": "Within Android Studio 4.0 Canary 1 we can start exploring Jetpack compose, a new way to build the UI for your android applications in a declarative manner. To get started with jetpack compose, there is a great tutorial on the official developer site. In this series of articles I want to dive into each of the components that are available, exploring how we can utilise each of them within our applications.",
    "body": [
      {
        "bodyType": "text",
        "data": "In this article we’re going to look with at the Container component. When it comes to containing a single view within a parent container for use within our layout we have a Composable Container component, located in the androidx.ui.layout package. This parent container can be used to add specific constraints to how our child component is laid out, as well as applying any styling that we may not want to add directly to the child component itself."
      },
      {
        "bodyType": "code",
        "data": "@Composable\nfun Container(\n    modifier: Modifier = Modifier.None,\n    padding: EdgeInsets = EdgeInsets(0.dp),\n    alignment: Alignment = Alignment.Center,\n    expanded: Boolean = false,\n    constraints: DpConstraints = DpConstraints(),\n    width: Dp? = null,\n    height: Dp? = null,\n    children: @Composable() () -> Unit\n) "
      },
      {
        "bodyType": "text",
        "data": "As we can see above, the Container holds a collection of properties which can be used to control the display of both the container and the child that is contained inside of it. When it comes to using the container, we need to wrap our child view like so:"
      },
      {
        "bodyType": "code",
        "data": "Container {\n    Text(text = \"Hello there\")\n}\n"
      },
      {
        "bodyType": "text",
        "data": "As you can see, this isn’t currently adding any extra value to our layout. Let’s take a look at each of the properties within our Container that we can utilise:\n\n"
      },
      {
        "bodyType": "text",
        "data": "PADDING\nThis property can be used to add padding to the container. This makes the container grow in size – which can be useful for when you need a container to be larger in some cases, for example when a component needs to be larger in size for visual purposes or when a touch state on a component needs to be larger."
      },
      {
        "bodyType": "image",
        "data": "https://joebirch.files.wordpress.com/2019/11/image-2019-11-10-at-7.33.50-am.png?w=415"
      },
      {
        "bodyType": "text",
        "data": "When assigning a value for either the width or height property we need to pass in a Dp reference, which declares the size to be given to each dimension."
      }
    ]
  },
  {
    "id": "ccf71518-327e-4ada-8c99-fba651d7f266",
    "source": "https://www.techyourchance.com/the-state-of-native-android-development-november-2019/",
    "title": "The State of Native Android Development, November 2019",
    "promoImage": "https://www.techyourchance.com/wp-content/uploads/2019/11/state_of_android_november_2019.jpeg",
    "preamble": "The ecosystem of native Android development is very dynamic. Well, at least I experienced it as such for the past five years, while I’ve been heavily involved in all things Android. During this period, Google released new sets of recommendations, libraries and frameworks every 2-3 years, and I invested much time to review these changes and sort out the sheep from the goats. I’m sure that many Android developers can relate to this experience.",
    "body": [
      {
        "bodyType": "text",
        "data": "However, this past year has been absolutely crazy even by Android ecosystem standards. Stuff got added, stuff got deprecated or removed, docs changed, new official guidelines were introduced, etc. When I come to think about it, I can’t draw a complete, detailed picture of Android development landscape in my mind anymore.\n\nTherefore, I decided to set some time aside for a research and then write this post. That’s my attempt to summarize what’s going on in Android ecosystem and make some predictions about the future of native development. I will structure my thoughts into sections dedicated to different topics, in no particular order, but I’ll try to keep the most controversial opinions for the end.\n\nI hope that this article will be interesting and useful to you, but keep in mind that I surely missed many important points and all my personal biases went into it.\n\nAndroidX\nIt’s kind of crazy to think about it, but AndroidX preview was announced just one and a half years ago. It became stable about a year ago, and at that point Google also stopped further development of the legacy support libraries. [the moment I wrote this sentence I recalled that I asked this question about the motivation behind support libraries on StackOverflow back when I was totally “green” Android developer]\n\nThe usage of the term “stable” to describe AndroidX is a bit ironic, though, because nothing about this set of artifacts is stable. Google constantly adds new libraries and frameworks under androidx. namespace, and many “old” APIs (which are barely one year old at this point) evolve at a very fast pace.\n\nTo this day I migrated two applications to AndroidX. It went alright and I don’t remember many surprises. Jetifier, the tool that redirects transitive dependencies on support libraries to their AndroidX counterparts, also worked surprisingly well. However, even though the applications weren’t big, it wasn’t a “one-click migration” either.\n\nI’m also involved in one project which hasn’t migrated to AndroidX yet (and it’s not even on the roadmap). No problems there. Looks like this is also a viable course of actions in some cases.\n\nAll in all, I’d say that new Android apps should definitely use AndroidX artifacts. I’d also recommend to plan for migration to AndroidX in existing project, even if you can’t see clear benefits right now. You’ll most probably need to migrate at some point anyway, so it’s better to do it on your own terms, instead of migrating in a rush when you’ll need some new AndroidX library in six months.\n\nJetpack\nAfter discussing AndroidX I must mention Jetpack, of course. As far as I remember, Jetpack started as an umbrella for “architecture components”, but expanded to incorporate most (or even all) APIs from AndroidX. Therefore, as of today, I don’t see any meaningful distinction between AndroidX and Jetpack. Except for, surprisingly, marketing and PR.\n\nWhen you look at Jetpack’s website, it does’t look like a resource for technical documentation. It looks like a landing page of an early-stage SaaS startup.\n\nTake for example these “testimonials”:"
      },
      {
        "bodyType": "image",
        "data": "https://www.techyourchance.com/wp-content/uploads/2019/11/jetpack_testimonials-800x345.jpg"
      },
      {
        "bodyType": "text",
        "data": "Or this “trusted by” section:"
      },
      {
        "bodyType": "image",
        "data": "https://www.techyourchance.com/wp-content/uploads/2019/11/jetpack_trusted_by-600x279.jpg"
      },
      {
        "bodyType": "text",
        "data": "Given such a focus on marketing and PR, I won’t be surprised if Jetpack files for a standalone IPO in 2020.\n\nSeriously, though, there is something deeply concerning about this attempt to “sell” APIs to developers in your own ecosystem. Like, why the hell would anyone want to actually advertise ViewModel in search?!"
      }
    ]
  }
]